InformationRegisters/Renault_Трафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Трафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыАктивностиТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Закрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_РабочийЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПервичныйПовторный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПервичныйПовторный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_УпущенныйТрафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_УпущенныйТрафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныУпущенныхКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторКомментария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУпущения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ТипыУпущенияТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Скрыт</Name>
					<Comment>Блинков для однозначного определения Скрытого трафика</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_РабочиеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РабочиеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ВоронкаПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ВоронкаПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЭтапыПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Renault_ПроверкаРаботыСистемы/Ext/Module.bsl
Процедура Renault_ПроверкаРаботыСистемы(Параметр = Неопределено) Экспорт
	ОбработкаНаСервере()
КонецПроцедуры

Процедура ОбработкаНаСервере() Экспорт
	
	BIR = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	Если Не ЗначениеЗаполнено(BIR) Тогда
		Возврат;
	КонецЕсли;
	
	АдресWS	 =Константы.Renault_АдресWebСервисов.Получить();
	Адрес = АдресWS +"ws/checkCRM.ws";
	Адрес = СтрЗаменить(Адрес, "?wsdl", "");
	ЛогинWS = Константы.Renault_ЛогинВебСервиса.Получить();
	ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();
	ВСОпределение = Новый WSОпределения(СокрЛП(Адрес) + "?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/checkCRM", 
							   "ПроверкаРаботыСистемыCRM","ПроверкаРаботыСистемыCRMSoap12",600);
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	СервисФабрика = ВебСервис.ФабрикаXDTO;

	//Отметка о работе системы
	Инфа  = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/checkCRM","ИнформацияОДЦ"));
	Инфа.BIR =BIR;
	Инфа.ВерсияАА = Метаданные.Версия;
	Инфа.ВерсияCRM = Константы.Renault_Версия.Получить();
	Инфа.ДатаАктуальности = ТекущаяДата();
	
	ИмяБд = "Неопределено";	
	Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Если Выборка.Следующий() Тогда
		ИмяБд = Выборка.Наименование;
	КонецЕсли;
	
	Итог = ВебСервис.CheckCRMv2(ИмяБд,Инфа);
	
	//Отправка статистики по данным
	СтатистикаКОтправке = ПолучитьСтатистикуПоДанным(BIR, ВебСервис.ФабрикаXDTO);
	ИтогОтправкиСтатистики = ВебСервис.RefreshStatisticsData(СтатистикаКОтправке);
	ЗадачиКВыполнению = ВебСервис.GetTask(BIR);
	Для Каждого ЗадачаКВыполнению Из ЗадачиКВыполнению.Строки Цикл
		Результат  = ВыполнитьЗадачу(ЗадачаКВыполнению);
		ВебСервис.RegTask(BIR,ЗадачаКВыполнению.Код,ТекущаяДата(),Результат);
	КонецЦикла;

	Если (Итог = Истина) И (ИтогОтправкиСтатистики = Истина)Тогда
		ВебСервис.RegOperation(BIR);
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьПрокси()
	
	Адрес = Константы.Renault_АдресWebСервисов.Получить();	
	Адрес = Адрес +"ws/checkCRM.ws";
	//Адрес = СтрЗаменить(Адрес, "?wsdl", "");
	ЛогинWS = Константы.Renault_ЛогинВебСервиса.Получить();
	ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();
	
	ОпределениеСервиса = Новый WSОпределения(Адрес, ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(ОпределениеСервиса, 
		"http://renault-nissan.com/schema/checkCRM", 
		"ПроверкаРаботыСистемыCRM",
		"ПроверкаРаботыСистемыCRMSoap12",
		600);
	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
	
	Возврат ВебСервис;	                        
	                         
КонецФункции
 
Функция ПолучитьСтатистикуПоДанным(Бир, ФабрикаСервис)
	
	МассивДЦ = ПолучитьМассивДЦ();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Renault_Трафик.Идентификатор) КАК КоличествоТрафика,
	                      |	Renault_Трафик.ДилерскийЦентр
	                      |ПОМЕСТИТЬ Трафик
	                      |ИЗ
	                      |	РегистрСведений.Renault_Трафик.СрезПоследних КАК Renault_Трафик
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Renault_Трафик.ДилерскийЦентр
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CRM_УпущенныйТрафикСрезПоследних.ИдентификаторТрафика) КАК КоличествоУпущеногоТрафика,
	                      |	CRM_УпущенныйТрафикСрезПоследних.ДилерскийЦентр
	                      |ПОМЕСТИТЬ УпущенныйТрафик
	                      |ИЗ
	                      |	РегистрСведений.CRM_УпущенныйТрафик.СрезПоследних КАК CRM_УпущенныйТрафикСрезПоследних
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	CRM_УпущенныйТрафикСрезПоследних.ДилерскийЦентр
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Renault_РабочиеЛисты.ID) КАК КоличествоРабочихЛистов,
	                      |	Renault_РабочиеЛисты.ДилерскийЦентр
	                      |ПОМЕСТИТЬ РЛ
	                      |ИЗ
	                      |	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Renault_РабочиеЛисты.ДилерскийЦентр
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(CRM_ВоронкаПродаж.IDK) КАК КоличествоВоронокПродаж,
	                      |	CRM_ВоронкаПродаж.ДилерскийЦентр
	                      |ПОМЕСТИТЬ ВП
	                      |ИЗ
	                      |	РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	CRM_ВоронкаПродаж.ДилерскийЦентр
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(CRM_КоммерческоеПредложениеСостав.Конфигурация) КАК КоличествоКонфигурацийКП,
	                      |	CRM_КоммерческоеПредложениеСостав.Ссылка.ДилерскийЦентр
	                      |ПОМЕСТИТЬ ККП
	                      |ИЗ
	                      |	Документ.CRM_КоммерческоеПредложение.Состав КАК CRM_КоммерческоеПредложениеСостав
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	CRM_КоммерческоеПредложениеСостав.Ссылка.ДилерскийЦентр
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	CRM_ДилерскиеЦентры.Ссылка,
	                      |	ВП.КоличествоВоронокПродаж,
	                      |	РЛ.КоличествоРабочихЛистов,
	                      |	Трафик.КоличествоТрафика,
	                      |	УпущенныйТрафик.КоличествоУпущеногоТрафика,
	                      |	&БазаДанных,
	                      |	ККП.КоличествоКонфигурацийКП
	                      |ИЗ
	                      |	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Трафик КАК Трафик
	                      |		ПО (Трафик.ДилерскийЦентр = CRM_ДилерскиеЦентры.Ссылка)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ УпущенныйТрафик КАК УпущенныйТрафик
	                      |		ПО CRM_ДилерскиеЦентры.Ссылка = УпущенныйТрафик.ДилерскийЦентр
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РЛ КАК РЛ
	                      |		ПО CRM_ДилерскиеЦентры.Ссылка = РЛ.ДилерскийЦентр
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВП КАК ВП
	                      |		ПО CRM_ДилерскиеЦентры.Ссылка = ВП.ДилерскийЦентр
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ККП КАК ККП
	                      |		ПО CRM_ДилерскиеЦентры.Ссылка = ККП.ДилерскийЦентр
	                      |ГДЕ
	                      |	CRM_ДилерскиеЦентры.Ссылка В(&Ссылки)");
						  Запрос.УстановитьПараметр("БазаДанных",Бир);
						  Запрос.УстановитьПараметр("Ссылки",МассивДЦ);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Таблица.Колонки.Добавить("ДилерскийЦентр");
	Для каждого Тек Из Таблица Цикл
		Тек.ДилерскийЦентр = Строка(Тек.Ссылка.УникальныйИдентификатор());
	КонецЦикла;
		Сериализатор = Новый СериализаторXDTO(ФабрикаСервис);
	ВозвратТаблицы = Сериализатор.ЗаписатьXDTO(Таблица);
	Возврат ВозвратТаблицы;
	
КонецФункции

Функция ПолучитьМассивДЦ()
	МассивДЦ = Новый Массив();
	Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.BIR) Тогда
			МассивДЦ.Добавить(Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;	
	Возврат МассивДЦ;
КонецФункции	

Функция ВыполнитьЗадачу(ЗадачаКВыполнению)
	Попытка	
		Обработка = ЗадачаКВыполнению.ОбработкаКВыполнению;
		КодКВыполнению = ЗадачаКВыполнению.КодКИсполнению;
		РезультатВыполнения ="";
		Если Не (Обработка = Неопределено) Тогда
			ПолныйПутьКобработке = ПолучитьИмяВременногоФайла("epf");
			Обработка.Записать(ПолныйПутьКОбработке);
			//ВнешниеОбработки.Подключить(ПолныйПутьКобработке,ЗадачаКВыполнению.Наименование,Ложь);
			ОбъектОбработка = ВнешниеОбработки.Создать(ПолныйПутьКобработке,Ложь);
			//Мета = ОбъектОбработка.Метаданные();
			Для Каждого ОписаниеПарам Из ЗадачаКВыполнению.Параметры Цикл
				ОбъектОбработка[ОписаниеПарам.ИмяПараметра]= ОписаниеПарам.ЗначениеПараметра;
			КонецЦикла;
			РезультатВыполнения =	ОбъектОбработка.ОбработкаНаСервере();
		КонецЕсли;
		Если (СтрДлина(КодКВыполнению)> 0 )  Тогда
			Выполнить(КодКВыполнению);
		КонецЕсли;
		
		Возврат РезультатВыполнения;
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;

КонецФункции
